perfect-RoR/actioncable-sample/app/channels/room_channel.rb

  def speak(data)
    message = Message.create!(content: data['message'])
---
INSERT INTO "messages" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "Action Cable is awesome."], ["created_at", "2022-05-06 07:16:29.404602"], ["updated_at", "2022-05-06 07:16:29.404602"]]