perfect-RoR/book_admin/app/controllers/books_controller.rb

    def set_book
      @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]